group-reports/shahriar-1-2-tests/results/disk-throughput-tuning-protocol-B-sndbuf-2k/test-5.txt
readwrite-randomly-test-job: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
readwrite-randomly-test-job: Laying out IO file (1 file / 10240MiB)

readwrite-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=15398: Sun Jul  9 03:46:39 2023
   read: IOPS=200, BW=1600KiB/s (1639kB/s)(940MiB/601265msec)
    slat (usec): min=4, max=85155, avg=74.35, stdev=579.88
    clat (msec): min=53, max=2644, avg=1274.86, stdev=54.35
     lat (msec): min=53, max=2644, avg=1274.94, stdev=54.35
    clat percentiles (msec):
     |  1.00th=[ 1150],  5.00th=[ 1267], 10.00th=[ 1267], 20.00th=[ 1267],
     | 30.00th=[ 1267], 40.00th=[ 1284], 50.00th=[ 1284], 60.00th=[ 1284],
     | 70.00th=[ 1284], 80.00th=[ 1284], 90.00th=[ 1284], 95.00th=[ 1301],
     | 99.00th=[ 1318], 99.50th=[ 1334], 99.90th=[ 1804], 99.95th=[ 2056],
     | 99.99th=[ 2366]
   bw (  KiB/s): min=   15, max=  256, per=6.28%, avg=100.50, stdev=44.28, samples=19084
   iops        : min=    1, max=   32, avg=12.44, stdev= 5.54, samples=19084
  write: IOPS=86, BW=690KiB/s (707kB/s)(405MiB/601265msec)
    slat (usec): min=5, max=805969, avg=404.24, stdev=10447.52
    clat (usec): min=962, max=1420.7k, avg=9572.14, stdev=46011.07
     lat (usec): min=1480, max=1420.8k, avg=9977.52, stdev=49168.55
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    5], 90.00th=[    9], 95.00th=[   17],
     | 99.00th=[  180], 99.50th=[  347], 99.90th=[  651], 99.95th=[  802],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=   15, max=  272, per=7.51%, avg=51.81, stdev=34.49, samples=15979
   iops        : min=    1, max=   34, avg= 6.35, stdev= 4.32, samples=15979
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.21%, 4=23.10%, 10=4.30%, 20=1.20%, 50=0.61%
  lat (msec)   : 100=0.24%, 250=0.29%, 500=0.19%, 750=0.09%, 1000=0.22%
  cpu          : usr=0.05%, sys=0.15%, ctx=173656, majf=0, minf=167
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120287,51883,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1600KiB/s (1639kB/s), 1600KiB/s-1600KiB/s (1639kB/s-1639kB/s), io=940MiB (985MB), run=601265-601265msec
  WRITE: bw=690KiB/s (707kB/s), 690KiB/s-690KiB/s (707kB/s-707kB/s), io=405MiB (425MB), run=601265-601265msec

Disk stats (read/write):
    drbd1: ios=120287/51923, merge=0/0, ticks=153147580/501149, in_queue=153648729, util=99.53%, aggrios=120287/51963, aggrmerge=0/0, aggrticks=153182381/222578, aggrin_queue=153404959, aggrutil=98.92%
    dm-0: ios=120287/51963, merge=0/0, ticks=153182381/222578, in_queue=153404959, util=98.92%, aggrios=120287/51963, aggrmerge=0/0, aggrticks=153182940/220103, aggrin_queue=153316098, aggrutil=98.95%
  vdb: ios=120287/51963, merge=0/0, ticks=153182940/220103, in_queue=153316098, util=98.95%